a = input("Введите идентификатор:")
i = a.find("@")
j = a.rfind(".")  
if a.count("@") == 0:
    r = "Отсутствует символ @"
elif a.count("@") > 1:
    r = "Символ @ встречается более одного раза"
elif i == 0:
    r = "Пустое имя пользователя (до @)"
elif j < i:
    r = "Отсутствует доменная зона (нет точки после @)"
elif j == len(a) - 1:
    r = "Отсутствует доменная зона (после точки)"
elif j == i + 1:
    r = "Отсутствует доменное имя (между @ и точкой)"
elif a.count(" ") > 0:
    r = "Иная причина"
else:
    r = ""

if r == "":
    print("ИДЕНТИФИКАТОР ВАЛИДЕН:", a)
else:
    print("ИДЕНТИФИКАТОР НЕВАЛИДЕН:", a)
    print("Причина:", r)
